; ModuleID = '/home/steve/Graduate_Research/MLP/PynqLib/pynqlib.c'
source_filename = "/home/steve/Graduate_Research/MLP/PynqLib/pynqlib.c"
target datalayout = "e-m:e-p:32:32-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv7--linux-gnueabihf"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i32, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i32, i32, [40 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [12 x i8] c"nr_free_cma\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"/proc/vmstat\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"%s %d\00", align 1
@.str.4 = private unnamed_addr constant [10 x i8] c"/dev/xlnk\00", align 1
@.str.5 = private unnamed_addr constant [42 x i8] c"Reset failed - could not open device: %d\0A\00", align 1
@.str.6 = private unnamed_addr constant [33 x i8] c"Reset failed - IOCTL failed: %d\0A\00", align 1

; Function Attrs: nounwind
define void @add_sw_estimates() #0 !dbg !12 !xidane.fname !15 !xidane.function_declaration_type !16 !xidane.function_declaration_filename !17 !xidane.ExternC !18 {
  ret void, !dbg !19
}

; Function Attrs: nounwind

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/steve/Graduate_Research/MLP/PynqLib/pynqlib.c", directory: "/home/steve/Graduate_Research/MLP/build")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32, align: 32)
!5 = !DIBasicType(name: "long unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{i32 1, !"min_enum_size", i32 4}
!10 = !{i32 1, !"PIC Level", i32 2}
!11 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!12 = distinct !DISubprogram(name: "add_sw_estimates", scope: !1, file: !1, line: 28, type: !13, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!13 = !DISubroutineType(types: !14)
!14 = !{null}
!15 = !{!"add_sw_estimates"}
!16 = !{!"void."}
!17 = !{!"/home/steve/Graduate_Research/MLP/PynqLib/pynqlib.c"}
!18 = !{!"t"}
!19 = !DILocation(line: 28, column: 30, scope: !12)
!20 = distinct !DISubprogram(name: "cma_pages_available", scope: !1, file: !1, line: 32, type: !21, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!21 = !DISubroutineType(types: !22)
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 26, baseType: !25)
!24 = !DIFile(filename: "/tools/Xilinx/SDK/2018.3/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/bits/stdint-uintn.h", directory: "/home/steve/Graduate_Research/MLP/build")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !26, line: 41, baseType: !27)
!26 = !DIFile(filename: "/tools/Xilinx/SDK/2018.3/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/bits/types.h", directory: "/home/steve/Graduate_Research/MLP/build")
!27 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!28 = !{!"cma_pages_available"}
!29 = !{!"uint32_t."}
!30 = !{!"/home/steve/Graduate_Research/MLP/PynqLib/libxlnk_cma.h"}
!31 = !DILocalVariable(name: "fp", scope: !20, file: !1, line: 34, type: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !34, line: 7, baseType: !35)
!34 = !DIFile(filename: "/tools/Xilinx/SDK/2018.3/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/bits/types/FILE.h", directory: "/home/steve/Graduate_Research/MLP/build")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !36, line: 241, size: 1216, align: 64, elements: !37)
!36 = !DIFile(filename: "/tools/Xilinx/SDK/2018.3/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/libio.h", directory: "/home/steve/Graduate_Research/MLP/build")
!37 = !{!38, !40, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !61, !62, !63, !64, !67, !69, !71, !75, !78, !82, !83, !84, !85, !86, !89, !90}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !35, file: !36, line: 242, baseType: !39, size: 32, align: 32)
!39 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !35, file: !36, line: 247, baseType: !41, size: 32, align: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32, align: 32)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !35, file: !36, line: 248, baseType: !41, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !35, file: !36, line: 249, baseType: !41, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !35, file: !36, line: 250, baseType: !41, size: 32, align: 32, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !35, file: !36, line: 251, baseType: !41, size: 32, align: 32, offset: 160)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !35, file: !36, line: 252, baseType: !41, size: 32, align: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !35, file: !36, line: 253, baseType: !41, size: 32, align: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !35, file: !36, line: 254, baseType: !41, size: 32, align: 32, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !35, file: !36, line: 256, baseType: !41, size: 32, align: 32, offset: 288)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !35, file: !36, line: 257, baseType: !41, size: 32, align: 32, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !35, file: !36, line: 258, baseType: !41, size: 32, align: 32, offset: 352)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !35, file: !36, line: 260, baseType: !54, size: 32, align: 32, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32, align: 32)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !36, line: 156, size: 96, align: 32, elements: !56)
!56 = !{!57, !58, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !55, file: !36, line: 157, baseType: !54, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !55, file: !36, line: 158, baseType: !59, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !55, file: !36, line: 162, baseType: !39, size: 32, align: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !35, file: !36, line: 262, baseType: !59, size: 32, align: 32, offset: 416)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !35, file: !36, line: 264, baseType: !39, size: 32, align: 32, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !35, file: !36, line: 268, baseType: !39, size: 32, align: 32, offset: 480)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !35, file: !36, line: 270, baseType: !65, size: 32, align: 32, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !26, line: 140, baseType: !66)
!66 = !DIBasicType(name: "long int", size: 32, align: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !35, file: !36, line: 274, baseType: !68, size: 16, align: 16, offset: 544)
!68 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !35, file: !36, line: 275, baseType: !70, size: 8, align: 8, offset: 560)
!70 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !35, file: !36, line: 276, baseType: !72, size: 8, align: 8, offset: 568)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !35, file: !36, line: 280, baseType: !76, size: 32, align: 32, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32, align: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !36, line: 150, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !35, file: !36, line: 289, baseType: !79, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !26, line: 141, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__quad_t", file: !26, line: 55, baseType: !81)
!81 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !35, file: !36, line: 297, baseType: !4, size: 32, align: 32, offset: 704)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !35, file: !36, line: 298, baseType: !4, size: 32, align: 32, offset: 736)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !35, file: !36, line: 299, baseType: !4, size: 32, align: 32, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !35, file: !36, line: 300, baseType: !4, size: 32, align: 32, offset: 800)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !35, file: !36, line: 302, baseType: !87, size: 32, align: 32, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 216, baseType: !27)
!88 = !DIFile(filename: "/tools/Xilinx/SDK/2018.3/gnu/aarch32/lin/gcc-arm-linux-gnueabi/lib/gcc/arm-linux-gnueabihf/7.3.1/include/stddef.h", directory: "/home/steve/Graduate_Research/MLP/build")
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !35, file: !36, line: 303, baseType: !39, size: 32, align: 32, offset: 864)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !35, file: !36, line: 305, baseType: !91, size: 320, align: 8, offset: 896)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 320, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 40)
!94 = !DIExpression()
!95 = !DILocation(line: 34, column: 12, scope: !20)
!96 = !DILocalVariable(name: "line", scope: !20, file: !1, line: 35, type: !41)
!97 = !DILocation(line: 35, column: 12, scope: !20)
!98 = !DILocalVariable(name: "len", scope: !20, file: !1, line: 36, type: !87)
!99 = !DILocation(line: 36, column: 12, scope: !20)
!100 = !DILocalVariable(name: "read", scope: !20, file: !1, line: 37, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !102, line: 71, baseType: !103)
!102 = !DIFile(filename: "/tools/Xilinx/SDK/2018.3/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/stdio.h", directory: "/home/steve/Graduate_Research/MLP/build")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !26, line: 181, baseType: !39)
!104 = !DILocation(line: 37, column: 13, scope: !20)
!105 = !DILocalVariable(name: "cmp", scope: !20, file: !1, line: 38, type: !41)
!106 = !DILocation(line: 38, column: 12, scope: !20)
!107 = !DILocalVariable(name: "dummy", scope: !20, file: !1, line: 39, type: !108)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 20)
!111 = !DILocation(line: 39, column: 10, scope: !20)
!112 = !DILocalVariable(name: "num", scope: !20, file: !1, line: 40, type: !39)
!113 = !DILocation(line: 40, column: 9, scope: !20)
!114 = !DILocation(line: 42, column: 10, scope: !20)
!115 = !DILocation(line: 42, column: 8, scope: !20)
!116 = !DILocation(line: 43, column: 9, scope: !117)
!117 = distinct !DILexicalBlock(scope: !20, file: !1, line: 43, column: 9)
!118 = !DILocation(line: 43, column: 12, scope: !117)
!119 = !DILocation(line: 43, column: 9, scope: !20)
!120 = !DILocation(line: 44, column: 9, scope: !117)
!121 = !DILocation(line: 46, column: 5, scope: !20)
!122 = !DILocation(line: 46, column: 41, scope: !123)
!123 = !DILexicalBlockFile(scope: !20, file: !1, discriminator: 1)
!124 = !DILocation(line: 46, column: 20, scope: !123)
!125 = !DILocation(line: 46, column: 18, scope: !123)
!126 = !DILocation(line: 46, column: 46, scope: !123)
!127 = !DILocation(line: 46, column: 5, scope: !123)
!128 = !DILocation(line: 47, column: 20, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !1, line: 47, column: 13)
!130 = distinct !DILexicalBlock(scope: !20, file: !1, line: 46, column: 53)
!131 = !DILocation(line: 47, column: 25, scope: !129)
!132 = !DILocation(line: 47, column: 13, scope: !129)
!133 = !DILocation(line: 47, column: 30, scope: !129)
!134 = !DILocation(line: 47, column: 13, scope: !130)
!135 = !DILocation(line: 48, column: 20, scope: !136)
!136 = distinct !DILexicalBlock(scope: !129, file: !1, line: 47, column: 38)
!137 = !DILocation(line: 48, column: 33, scope: !136)
!138 = !DILocation(line: 48, column: 13, scope: !136)
!139 = !DILocation(line: 49, column: 9, scope: !136)
!140 = !DILocation(line: 46, column: 5, scope: !141)
!141 = !DILexicalBlockFile(scope: !20, file: !1, discriminator: 2)
!142 = distinct !{!142, !121}
!143 = !DILocation(line: 51, column: 12, scope: !20)
!144 = !DILocation(line: 51, column: 5, scope: !20)
!145 = !DILocation(line: 52, column: 12, scope: !20)
!146 = !DILocation(line: 52, column: 5, scope: !20)
!147 = !DILocation(line: 53, column: 1, scope: !20)
!148 = !{!"fopen"}
!149 = !{!"FILE .const char *__restrict.1.const char *__restrict.1"}
!150 = !{!"/tools/Xilinx/SDK/2018.3/gnu/aarch32/lin/gcc-arm-linux-gnueabi/arm-linux-gnueabihf/libc/usr/include/stdio.h"}
!151 = !{!"getline"}
!152 = !{!"__ssize_t.char **__restrict.1.size_t *__restrict.1.FILE *__restrict.1"}
!153 = !{!"strstr"}
!154 = !{!"char .const char *.1.const char *.1"}
